{
  "base_model_name_or_path": "TinyLlama/TinyLlama-1.1B-Chat",
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "inference_mode": false,
  "r": 8,
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "down_proj",
    "up_proj"
  ],
  "modules_to_save": ["lm_head"],
  "fan_in_fan_out": false
}